# -*- coding: utf-8 -*-

# -------------------------------------------------------------
# =============================================================
# TELEGRAM BOT-+=
# -------------------------------------------------------------
BOT_API_TOKEN = '6337261385:AAEp6bGQNVxfaG9Rg5cBlccQ8M4Qz3KKyPc'

BOT_ADMINS = [5172447001]  # , 1280985750]
#                        KuznecovAO
BOT_USERS = [5172447001, 1919089583]
#                            Koryahova  KuznecovAO
BOT_OPERATORS = [5172447001, 803218706, 1919089583]

BOT_HELP_ADM_COMMANDS = [
    "/help - справка по командам",
    "/urls - ссылки на страницы с данными",
    "/list - список файлов в хранилище",
    "/get - запрос файла из хранилища",
    "/id - id пользователя",
    "/cron - расписание сканирования",
    "/cancel - выход из режима"
]

BOT_HELP_OPERATOR_COMMANDS = [
    "/help - справка по командам",
    "/urls - ссылки на страницы с данными",
    "/list - список файлов в хранилище",
    "/get - запрос файла из хранилища",
    "/id - id пользователя",
    "/cancel - выход из режима"
]


BOT_HELP_USER_COMMANDS = [
    "/help - справка по командам",
    "/urls - ссылки на страницы с данными",
    "/list - список файлов в хранилище",
    "/id - id пользователя",
    "/cancel - выход из режима"
]

FILE_REQUEST_TIMEOUT = 300

BOT_KEY_ICONS = ['🗃️', '📁', '🌐']

# -------------------------------------------------------------
# =============================================================
# E-MAIL-+=
# -------------------------------------------------------------
EMAIL_HOST = 'smtp.gmail.com'
EMAIL_PORT = 587
EMAIL_APP_NAME = 'ScanerBot'
EMAIL_LOGIN = 'vomit2180@gmail.com'
EMAIL_PASSWORD = 'bhvy utfg keqp oiag'
EMAIL_MAX_FILE_SIZE = 1048576

