# -*- coding: utf-8 -*-

BOT_LANG = {
    '/cron': 'Расписание сконирования:',
    '/get':  'Выберите источник:',
    '/get file choice': 'Выберите файл для скачивания:',
    '/get upload...': 'Выгрузка файла ...',
    '/get cancel': '❌Отменена команда /get',
    '/get ready': '✅Выгрузка завершена!',
    '/user':  'Выберите действие с пользователями:',
    '/user role choice':  'Выберите роль пользователя:',
    '/user cancel': '❌Отменена команда /user',
    'wrong choice': 'Попробуйте еще раз или введите команду /cancel для отмены действия',
    'start bot': '🚬 <b>Woody</b> готов к работе!'
}